/******************************************************************************/
/*                                                                            */
/*    ACS               Application Construction System                       */
/*    REVISION:         17. April 2001                                        */
/*    DESCRIPTION:      Headerdatei der îffentlichen Konstanten, Strukturen   */
/*                      und Routinen des Entwicklungssystems ACSpro           */
/*                                                                            */
/* (c) 1991-2004 Stefan Bachert, Oliver Michalak, Martin ElsÑsser             */
/******************************************************************************/

#ifndef __ACS__
#define __ACS__

/* Es sind C-Deklarationen */
#ifdef __cplusplus
extern "C" {
#endif

/* Kommentar entfernen fÅr Makro-Zugriffe auf */
/* die ACSblk-Variablen der ACS-Version 1.x   */
/*#define __ACS1__ */

/******************************************************************************/
/*                                                                            */
/* Benîtigte Header-Dateien einlesen                                          */
/*                                                                            */
/******************************************************************************/

#include    <acstos.h>
#include    <acsaes.h>
#include    <acsvdi.h>
#include    <acstype.h>

/* Ggf. die Cookie-Konstanten einlesen */
#ifndef _cookie_h_
   #include <acscook.h>
#endif

/******************************************************************************/
/*                                                                            */
/* Globale ACS-Datentypen                                                     */
/*                                                                            */
/******************************************************************************/

/* Ein Element einer einfach verketten linearen Liste */
typedef struct _ACSNextStruct
{
   struct _ACSNextStruct *next;
   void *data;
} A_ListNextStruct;

/******************************************************************************/
/*                                                                            */
/* GEM-Objekte - Teil 1                                                       */
/*                                                                            */
/******************************************************************************/

/* Infos Åber die Listen der freien Blîcke von ACS */
typedef struct
{
   ssize_t block_size;
   const char *descr_text;
   int16 max_liste;
   int16 aktuell_liste;
   int16 max_used;
   int16 opt_anzahl;
} MemFreeBlockStat;

/******************************************************************************/
/*                                                                            */
/* GEM-Objekte                                                                */
/*                                                                            */
/******************************************************************************/

/* Lokale Definition */
#define swd struct wd

/* ForwÑrts-Deklaration wegen rekursiver Verwendung */
swd;

/* Zeiger auf Create-Routine als Datentype */
typedef swd* (*Acreate) (void *x);

/******************************************************************************/

/* Mouse parameters */
typedef struct
{
   int16 number;                       /* Mousenumber 255=Userdef */
   MFORM* form;                        /* Mouseform or NULL */
} Amouse;

/******************************************************************************/

/* Struktur fÅr Antworten auf GEMScript-Kommandos */
typedef struct
{
   char **antwort;
   int16 anzahl;
   int16 ret_wert;
} A_GSAntwort;

/******************************************************************************/

/* Das zentrale Window-Objekt */
typedef struct wd
{
   /* Users part */
   /*   0 */ void *user;                      /* Users object pointer */
   /*   4 */ boolean (*service)(swd *a,         /* Service call */
                  int16 task, void *in_out);
   /*   8 */ swd *(*create)(void *a);         /* create window passing window specific parameters */
   /*  12 */ int16 (*open)(swd *a);           /* open window return success */
   /*  16 */ int16 (*init)(swd *a);           /* init window return success */
   /*  20 */ OBJECT *work;                    /* Object within window */
   /*  24 */ OBJECT *toolbar;                 /* Toolbar */
   /*  28 */ int16 ob_edit, ob_col;           /* object nr and act column */

   /* GEM attributes */
   /*  32 */ int16 wi_id;                     /* gem window id or -1 */
   /*  34 */ int16 wi_kind;                   /* window attributes */
   /*  36 */ Axywh wi_act;                    /* actual outer coordinates */
   /*  44 */ Axywh wi_normal;                 /* normal outer coordinates */
   /*  52 */ Axywh wi_work;                   /* inner size without menu */
   /*  60 */ Axywh wi_slider;                 /* last set slider (init -1) */
   /*  68 */ int16 wi_nx, wi_ny;              /* normal offset zero or negative */
   /*  72 */ int16 snap_mask;                 /* hi y lo x, snap mask due to pattern offset */
   /*  74 */ char *name;                      /* points to name */
   /*  78 */ char *info;                      /* points to info */

   /* ACS attributes */
   /*  82 */ int16 ob_len;                    /* len of edit-block-text, 0 if no selection */
   /*  84 */ int16 kind;                      /* own attributes */
   /*  86 */ int16 state;                     /* state of window */
   /*  88 */ int16 icon;                      /* objectnr in root window, -1 if not */
   /*  90 */ CICONBLK *iconblk;               /* defines the Iconimage, NULL means default Icon */

   /* Menue */
   /*  94 */ OBJECT *menu;                    /* Menu-Tree OBJECT */

   /* Keyboard */
   /*  98 */ int16 (*keys)(swd *x,            /* unknown key actions */
                  int16 kstate, int16 key);

   /* mouse select */
   /* 102 */ void (*obchange)(swd *a,         /* change state of this object */
                  int16 obnr, int16 new_state);

   /* window attribute reactions */
   /* 106 */ void (*redraw)(swd *a, Axywh *b);      /* Redraw */
   /* 110 */ void (*topped)(swd *a);                /* Topped */
   /* 114 */ void (*closed)(swd *a);                /* Closed */
   /* 118 */ void (*fulled)(swd *a);                /* Fulled */
   /* 122 */ void (*arrowed)(swd *a, int16 which,   /* Arrowed */
                  int16 amount);
   /* 126 */ void (*hslid)(swd *a, int16 pos);      /* HSlide */
   /* 130 */ void (*vslid)(swd *a, int16 pos);      /* VSlide */
   /* 134 */ void (*sized)(swd *a, Axywh *b);       /* Sized */
   /* 138 */ void (*moved)(swd *a, Axywh *b);       /* Moved */

   /* new in 3.0.0: */
   /* 142 */ int16 (*iconify)(swd *a, int16 all);   /* Iconify, Iconify All */
   /* 146 */ int16 (*uniconify)(swd *a);            /* Uniconify */

   /* 150 */ int16 (*gemscript)(swd *a, int16 anz,  /* GEMScript */
                  char **cmds, A_GSAntwort *antwort );

   /* 154 */ char *help_title;                      /* Titel der Hilfe-Seite */
   /* 158 */ char *help_file;                       /* Name der Hilfe-Datei */
   /* 162 */ 
} Awindow;

/******************************************************************************/
/*                                                                            */
/* ACS-standardisierte Fehlermeldungsnummern                                  */
/*                                                                            */
/******************************************************************************/

#define AD_COUNT              34

#define AD_GENERAL            0
#define AD_GENERAL_STR        1
#define AD_COLREZ             2
#define AD_CREATE_IO          3
#define AD_CREATE_STR         4
#define AD_DEFECTIVE_MEM      5
#define AD_ERR_ACC            6
#define AD_ERR_MESS           7
#define AD_ERR_WINDOW         8
#define AD_ERR_WISLOT         9
#define AD_GEN_IO             10
#define AD_GEN_MEM            11
#define AD_GEN_MOD            12
#define AD_GEN_MOD_STR        13
#define AD_LOAD_MOD           14
#define AD_LOAD_MOD_STR       15
#define AD_MEM_MOD            16
#define AD_MEM_MOD_STR        17
#define AD_ODD_MEM            18
#define AD_OPEN_IO            19
#define AD_OPEN_STR           20
#define AD_OUT_OF_MEM         21
#define AD_PORT               22
#define AD_RANGE_MEM          23
#define AD_READ_IO            24
#define AD_READ_STR           25
#define AD_VER_MOD            26
#define AD_VER_MOD_STR        27
#define AD_WRITE_IO           28
#define AD_WRITE_STR          29
#define AD_A_ATT              30
#define AD_A_QUEST            31
#define AD_A_STOP             32
#define AD_A_TIMER            33

/******************************************************************************/
/*                                                                            */
/* Die Konfigurations-String-UnterstÅtzung                                    */
/*                                                                            */
/******************************************************************************/

/* Maximale LÑnge eines Config-Strings insgesamt! */
#define MAX_CFGLEN 8192

/******************************************************************************/

typedef struct
{
   /*  0 */ char *dateiname;
   /*  4 */ char *comment;
   /*  8 */ char *env_praefix;
   /* 12 */ int16 casesensitiv;
   /* 14 */ int16 file_sensitiv;
   /* 16 */ int16 file_buffer;
   /* 18 */ 
} UCfgInfo;

/******************************************************************************/
/*                                                                            */
/* Initialisierungs-Infos fÅr den Anwendungsstart                             */
/*                                                                            */
/******************************************************************************/

typedef struct
{
   /*   0 */ char     magic[8];            /* Magic "ACS 2.0" */
   /*   8 */ int16    version;             /* Version * 200 */
   /*  10 */ int16    dx,dy;               /* virtuell desktop increments */
   /*  14 */ uint16   flags;               /* commom flags */
   /*  16 */ char     acc_reg[32];         /* Accessory register message */
   /*  48 */ Awindow  *root;               /* Root window */
   /*  52 */ Awindow  *acc;                /* Accessory first window */
   /*  56 */ Amouse   mouse[32];           /* 32 Mouseforms */
   /* 248 */ char     *mess[AD_COUNT];     /* multilinguale Strings */
   /* 384 */
} Adescr;

/******************************************************************************/

/* Initialisierungs-Infos fÅr den Anwendungsstart */
typedef struct
{
   /*   0 */ UCfgInfo CfgInfo;                                     /* Infos zum Laden der Cfg-Strings */
   /*  18 */ char *BaseName;                                       /* Zu verwendender Name fÅr basename */

   /* Initialisierungszeiger in ACSblk fÅr ACS-Interna */
   /*  22 */ void (*ACSterm)( void );                              /* called before terminating ACS */
   /*  26 */ void (*ACSaboutme)( void );                           /* call used for 'about me' */
   /*  30 */ void (*ACSclose)( void );                             /* call used for 'Quit' */
   /*  34 */ void (*ACSmessage)( int16 *ev_mmgpbuf );              /* handle unprocessed messages */
   /*  38 */ void (*ACSmproto)( int16 *ev_mmgpbuf );               /* filter unprocessed messages */
   /*  42 */ void (*ACStimer)( void );                             /* called at end of event loop */
   /*  46 */ void (*ACSkey)( int16 *kstate, int16 *key );          /* filter keys */
   /*  50 */ void (*ACSbutton)( int16 *button, int16 *breturn );   /* filter mouse buttons */
   /*  54 */ void (*ACSmouse)( void );                             /* filter mouse moves (ev_mmox/y) */
   /*  58 */ void (*ACSwikey)( int16 *kstate, int16 *key );        /* filter keystroke before wi->keys call */

   /*  62 */ int16 init_prot;                                      /* Welche Protokolle sollen (komplett) initialisiert werden? */
   /*  64 */ int16 XAccType;                                       /* Maschinenlesbarer XAcc-Programmtyp */

   /* Initialisierungszeiger in ACSblk fÅr GEMScript */
   /*  66 */ int16 (*ACSGEMScript)( int16 anz, char **cmd, A_GSAntwort *antwort );   /* Allgemeine GEMScript-Funktion */

   /* Start-Funktionen fÅr ACS */
   /*  70 */ int16 (*ACSinit0)( void );                            /* Initialisierung nach GEM-Initialisierung */
   /*  74 */ int16 (*ACSinit)( void );                             /* Initialisierung nach der ACS-Initialisierung */

   /* Initialisierungszeiger in ACSblk fÅr AV-Protokoll */
   /* Noch nicht implementiert */
   /*  78 */ 
} Aconfig;

/******************************************************************************/

/* Flags fÅr die Initialisierung der Protokolle beim Systemstart                           */
/* Falls die Protokolle nicht initialisiert werden, wird dies nachgeholt, sobald sie       */
/* das erstemal benîtigt werden!                                                           */
#define CFG_INIT_OLGA         0x0001      /* Starte ggf. OLGA-Manager nach,                */
                                          /* Anmeldung beim OLGA-Manager anstoûen          */
#define CFG_INIT_OLGA_FULL    0x0002      /* ZusÑtzlich auf das Ende der OLGA-             */
                                          /* Initialisierung warten                        */
#define CFG_INIT_GEMSCRIPT    0x0004      /* Volle Initialisiere des GEMScript-Protokolles */
#define CFG_INIT_BUBBLEGEM    0x0008      /* Ggf. BubbleGEM nachstarten und initialisieren */

/******************************************************************************/

/* Die Flags fÅr die Behandlung von nicht bearbeiteten "normalen"  */
/* TastendrÅcken zum Setzen der Variablen ACSblk->keyAltCtrlSwitch */
#define KEY_AC_NONE              0x0000
#define KEY_AC_ALT_WORK          0x0001
#define KEY_AC_CTRL_WORK         0x0002
#define KEY_AC_ALT_CTRL_WORK     0x0004
#define KEY_AC_CTRL_FIRST_WORK   0x0008
#define KEY_AC_ALT_TOOL          0x0010
#define KEY_AC_CTRL_TOOL         0x0020
#define KEY_AC_ALT_CTRL_TOOL     0x0040
#define KEY_AC_CTRL_FIRST_TOOL   0x0080
#define KEY_AC_TOOL_FIRST        0x0100

/******************************************************************************/
/*                                                                            */
/* Struktur der Auswahl-Liste                                                 */
/*                                                                            */
/******************************************************************************/

/* list of selected Objects */
typedef struct
{
   Awindow *window;                 /* the objects belong to this window */
   int16 maxlen;                    /* max entries in list */
   int16 actlen;                    /* actual count */
   int16 next;                      /* next entry return by Adr_next */
   int16 dragback;                  /* drag still selected object back to origin */
   int16 x, y;                      /* position during pick up */
   int16 rx, ry;                    /* relativ dragged distance */
   int16 *array;                    /* points to array of obnr's */
} Asel;

/******************************************************************************/
/*                                                                            */
/* Konstanten und Strukturen der Kommunikations-Protokolle                    */
/*                                                                            */
/******************************************************************************/

#define DD_PIPEDD (0x1)          /* ATARI-Pipe-Drag&Drop */
#define DD_XACC   (0x2)          /* XACC-D&D */
#define DD_VA     (0x4)          /* VA-Server */

/******************************************************************************/

/* XACC-Messages */
#ifndef __xaccproto__
   #define __xaccproto__
   #define ACC_ID             0x400
   #define ACC_OPEN           0x401
   #define ACC_CLOSE          0x402
   #define ACC_ACC            0x403
   #define ACC_EXIT           0x404
   #define ACC_ACK            0x500
   #define ACC_TEXT           0x501
   #define ACC_KEY            0x502
   #define ACC_META           0x503
   #define ACC_IMG            0x504
#endif

/******************************************************************************/

/* AV-Messages */
#ifndef __vaproto__
   #define __vaproto__
   #define AV_PROTOKOLL       0x4700
   #define VA_PROTOSTATUS     0x4701
   #define AV_GETSTATUS       0x4703
   #define AV_STATUS          0x4704
   #define VA_SETSTATUS       0x4705
   #define AV_SENDCLICK       0x4709
   #define AV_SENDKEY         0x4710
   #define VA_START           0x4711
   #define AV_ASKFILEFONT     0x4712
   #define VA_FILEFONT        0x4713
   #define AV_ASKCONFONT      0x4714
   #define VA_CONFONT         0x4715
   #define AV_ASKOBJECT       0x4716
   #define VA_OBJECT          0x4717
   #define AV_OPENCONSOLE     0x4718
   #define VA_CONSOLEOPEN     0x4719
   #define AV_OPENWIND        0x4720
   #define VA_WINDOPEN        0x4721
   #define AV_STARTPROG       0x4722
   #define VA_PROGSTART       0x4723
   #define AV_ACCWINDOPEN     0x4724
   #define VA_DRAGACCWIND     0x4725
   #define AV_ACCWINDCLOSED   0x4726
   #define AV_COPY_DRAGGED    0x4728
   #define VA_COPY_COMPLETE   0x4729
   #define AV_PATH_UPDATE     0x4730
   #define AV_WHAT_IZIT       0x4732
   #define VA_THAT_IZIT       0x4733
   #define AV_DRAG_ON_WINDOW  0x4734
   #define VA_DRAG_COMPLETE   0x4735
   #define AV_EXIT            0x4736
   #define AV_STARTED         0x4738
   #define VA_OB_UNKNOWN      0
   #define VA_OB_TRASHCAN     1
   #define VA_OB_SHREDDER     2
   #define VA_OB_CLIPBOARD    3
   #define VA_OB_FILE         4
   #define VA_OB_FOLDER       5
   #define VA_OB_DRIVE        6
   #define VA_OB_WINDOW       7
#endif

/******************************************************************************/

typedef struct
{
   int16       id;            /* The AES-ID of another PRG        */
   int32       type;          /* DD_* protocol flags              */
   uint16      xacc_val;      /* DD-dependant-value: XACC->groups */
   const char  *xacc_name;    /* Name of Partner, or NULL         */
   uint16      va_val[3];     /* Status-Bits of VA_PROTOSTATUS    */
   const char  *va_name;      /* The VA-Name                      */
} A_dd;

/******************************************************************************/

/* Informationen fÅr UserDef bei AUO_SELF */
typedef struct
{
   Awindow *window;
   OBJECT *entry;
   int16 obnr;
} Awiob;

/******************************************************************************/
/*                                                                            */
/* Zeichensatzwandelungen Åber KEYTAB                                         */
/*                                                                            */
/******************************************************************************/

#include "keytab.h"

/******************************************************************************/
/*                                                                            */
/* Die lineare unsortierte Liste                                              */
/*                                                                            */
/******************************************************************************/

typedef void (*A_ListFree)(void *elem);
typedef int16 (*A_ListFor)(void *para, void *elem);
typedef void (*A_ListWork)(void *para, void *elem);

/******************************************************************************/

/* Keine FOR-Funktion, alle Daten sollen bearbeitet/gesucht werden */
#define NO_FOR ((A_ListFor)NULL)

/******************************************************************************/

typedef struct _ULinList
{
   /* Der Zeiger auf die lineare Liste (soll nur ACS-intern verwendet werden!) */
   /*   0 */ void *ListData;

   /* Zeiger auf Funktion, die die Elemente der Liste freigeben kann */
   /*   4 */ void (*freeElem)( void *elem );

   /* Die lineare Liste leeren, alle Daten freigeben */
   /*   8 */ void (*clear)( struct _ULinList *liste );

   /* AnhÑngen neuer Daten an die Liste */
   /*  12 */ boolean (*append)( struct _ULinList *liste, void *new_data );

   /* EinfÅgen neuer Daten in die Liste */
   /*  16 */ int16 (*insert)( struct _ULinList *liste, void *new_data, int16 before_obj );

   /* Daten aus der Liste lîschen und zurÅckgeben */
   /*  20 */ void *(*delete)( struct _ULinList *liste, int16 data_nr );

   /* Alle Daten aus der Liste lîschen, die eine bestimmte Bedingung erfÅllen     */
   /* Der Parameter para wird an den gleichnamigen Parameter der in to_delete     */
   /* Åbergebenen Funktion weitergereicht (z.B. öbergabe der Vergleichskriterien) */
   /*  24 */ int32 (*deleteFor)( struct _ULinList *liste, void *para, boolean (*to_delete)(void *para, void *elem) );

   /* Die Daten Nummer nr holen */
   /*  28 */ void *(*search)( struct _ULinList *liste, int32 nr );

   /* Daten suchen, die eine Bedingung erfÅllen                                 */
   /* Der Parameter para wird an den gleichnamigen Parameter der in found Åber- */
   /* gebenen Funktion weitergereicht (z.B. öbergabe der Vergleichskriterien)   */
   /*  32 */ void *(*searchFor)( struct _ULinList *liste, void *para, boolean (*found)(void *para, void *elem) );

   /* Das erste Element der Liste */
   /*  36 */ void *(*first)( struct _ULinList *liste );

   /* Das letzte Element der Liste */
   /*  40 */ void *(*last)( struct _ULinList *liste );

   /* Das aktuelle Element der Liste */
   /*  44 */ void *(*akt)( struct _ULinList *liste );

   /* Die Nummer des aktuellen Elementes der Liste */
   /*  48 */ int32 (*aktNr)( struct _ULinList *liste );

   /* Das aktuelle Element vorwÑrts/rÅckwÑrts bewegen */
   /*  52 */ void *(*skip)( struct _ULinList *liste, boolean forwards, int32 amount );

   /* Die Anzahl der verwalteten Daten */
   /*  56 */ int32 (*count)( struct _ULinList *liste);

   /* Die Anzahl der Daten ermitteln, die eine Bedingung erfÅllen */
   /* Der Parameter para wird an den gleichnamigen Parameter der in found Åber- */
   /* gebenen Funktion weitergereicht (z.B. öbergabe der Vergleichskriterien)   */
   /*  60 */ int32 (*countFor)( struct _ULinList *liste, void *para, boolean (*count)(void *para, void *elem) );

   /* FÅr alle Daten, die eine Bedingung erfÅllen, eine Aktion ausfÅhren               */
   /* Der Parameter para wird an den gleichnamigen Parameter der in to_work und        */
   /* work Åbergebenen Funktion weitergereicht (z.B. öbergabe der Vergleichskriterien) */
   /*  64 */ void (*doFor)( struct _ULinList *liste, void *para,
            boolean (*to_work)(void *para, void *elem),
            void (*work)(void *para, void *elem) );
} ULinList;

/* For backward compatibility only */
#define ULinListe ULinList

/******************************************************************************/
/*                                                                            */
/* Der Stack (Stapel)                                                         */
/*                                                                            */
/******************************************************************************/

/* AbkÅrzung, da Zeiger auf Struktur in deren Deklaration benîtigt werden */
#define _ss struct _Stack

typedef struct _Stack
{
   /* Der Zeiger auf die Elemente des Stacks (sollte nur ACS-intern verwendet werden!) */
   A_ListNextStruct *StackData;

   /* Zeiger auf Funktion, die die Elemente der Liste freigeben kann */
   void (*freeElem)( void *elem );

   /* Ein Element auf den Stack legen */
   boolean (*push)( _ss *stack, void *elem );

   /* Das oberste ELement vom Stack holen */
   void *(*pop)( _ss *stack );

   /* PrÅfen, ob der Stack leer ist */
   boolean (*isEmpty)( _ss *stack );

   /* Die Anzahl der Elemente auf dem Stack ermitteln */
   int32 (*count)( _ss *stack );

   /* Den Stack komplett lîschen */
   void (*clear)( _ss *stack );
} Stack;

#undef _ss

/******************************************************************************/
/*                                                                            */
/* Die Warteschlange (Queue)                                                  */
/*                                                                            */
/******************************************************************************/

typedef struct _Queue Queue;
struct _Queue
{
   /* Der Zeiger auf die Queue (soll nur ACS-intern verwendet werden!) */
   void *QueueData;

   /* Zeiger auf Funktion, die die Elemente der Liste freigeben kann */
   void (*freeElem)( void *elem );

   /* Ein Element in die Queue stellen */
   boolean (*put)( Queue *queue, void *elem );

   /* Das erste Element aus der Queue holen */
   void *(*get)( Queue *queue );

   /* PrÅfen, ob die Queue leer ist */
   boolean (*isEmpty)( Queue *queue );

   /* Die Anzahl der Elemente in der Queue ermitteln */
   int32 (*count)( Queue *queue );

   /* Die Queue komplett lîschen */
   void (*clear)( Queue *queue );
};

/******************************************************************************/
/*                                                                            */
/* Zentrale ACS-Variablen                                                     */
/* Diese Variablen sind bereits vor Aufruf von ACSinit0 initialisiert         */
/*                                                                            */
/******************************************************************************/

/* Pathsize */
#define __PS__ (127 + 1)

/******************************************************************************/

typedef struct
{
    /* AES */
    /*    0 */ int16 gl_apid;                            /* AES application ID */
    /*    2 */ int16 phys_handle;                        /* workstation for aes */
    /*    4 */ int16 gl_wattr;                           /* attribut width */
    /*    6 */ int16 gl_hattr;                           /* attribut height */
    /*    8 */ Axywh desk;                               /* desktop limits XYWH */

    /* VDI */
    /*   16 */ int16 vdi_handle;                         /* virtual VDI workstation for ACS */
    /*   18 */ int16 gl_wbox;                            /* cell width of standard char */
    /*   20 */ int16 gl_hbox;                            /* cell height of standard char */
    /*   22 */ int16 gl_wchar;                           /* max width of standard char */
    /*   24 */ int16 gl_hchar;                           /* max height of standard char */
    /*   26 */ int16 ncolors;                            /* number of colors (2=mono) */
    /*   28 */ int16 nplanes;                            /* number of colors expressed in planes */

    /* Pathes */
    /*   30 */ char appname [__PS__];                    /* application complete name */
    /*  158 */ char apppath [__PS__];                    /* application path */
    /*  286 */ char apppara [__PS__];                    /* application parameter */
    /*  414 */ char appfrom [__PS__];                    /* application called from */
    /*  542 */ char basename[20];                        /* basename appname without extention */

    /* others */
    /*  562 */ int32 ev_mtcount;                         /* Timerintervall in milli sec (initial 500 ms) */
    /*  566 */ boolean application;                      /* runs as an application */
    /*  568 */ boolean multitask;                        /* more than 1 applications possible */
    /*  570 */ boolean appexit;                          /* application is in system termination mode */
    /*  572 */ Adescr *description;                      /* surface description, pointer for late assignment */
    /*  576 */ Asel Aselect;                             /* list of selected objects */

    /* context during callback pointer values */
    /*  600 */ Awindow *ev_window;                       /* actual window */
    /*  604 */ OBJECT *ev_object;                        /* actual object tree */
    /*  608 */ int16 ev_obnr;                            /* actual objectnumber, index */
    /*  610 */ int16 ev_mmox, ev_mmoy;                   /* Mouse position */
    /*  614 */ int16 ev_mmokstate;                       /* Keyboard state */
    /*  616 */ int16 dia_abort;                          /* Abort modal dialog */
    /*  618 */ MFDB screenMFDB;                          /* exactly this */
    /*  638 */ boolean apterm;                           /* AP_TERM received */
    /*  640 */ int16 *AESglobal;                         /* points to initialized (AES) global */
    /*  644 */ int16 fonts;                              /* count of available fonts */
    /*  646 */ int16 argc;                               /* parameter passed to main routine */
    /*  648 */ char **argv;                              /* argument list */
    /*  652 */ char **env;                               /* environment */
    /*  656 */ int16 fontid;                             /* Fontid for Userdefs */
    /*  658 */ int16 fheight;                            /* Height for Userdeffonts */
    /*  660 */ int16 fontsid;                            /* Fontid for Userdef (small) */
    /*  662 */ int16 fsheight;                           /* Height for Userdeffonts (small) */
    /*  664 */ void (*ACSterm) (void);                   /* called before terminating ACS */
    /*  668 */ void (*ACSaboutme) (void);                /* call used for 'about me' */
    /*  672 */ void (*ACSclose) (void);                  /* call used for 'Quit' */
    /*  676 */ void (*ACSmessage)(int16 *ev_mmgpbuf);    /* handle unprocessed messages */
    /*  680 */ void (*ACSmproto)(int16 *ev_mmgpbuf);     /* filter unprocessed messages */
    /*  684 */ void (*ACStimer)(void);                   /* called at end of event loop */
    /*  688 */ int16 (*ACSinit0)(void);                  /* pre init */
    /*  692 */ int16 dither;                             /* dither config */
    /*  694 */ void (*ACSkey)(int16 *kstate, int16 *key);/* filter keys */
    /*  698 */ void (*ACSbutton)(int16 *button, int16 *breturn);  /* filter mouse buttons */
    /*  702 */ void (*ACSmouse)(void);                   /* filter mouse moves (ev_mmox/y) */
    /*  706 */ void (*ACSwikey)(int16 *kstate, int16 *key);    /* filter keystroke before wi->keys call */
    /*  710 */ int16 ev_bmask;                           /* evnt_multi */
    /*  712 */ int16 ev_bstate;                          /* evnt_multi */
    /*  714 */ int16 ev_mmobutton;                       /* evnt_multi */
    /*  716 */ int16 ev_mbreturn;                        /* evnt_multi */
    /*  718 */ int16 ev_mkreturn;                        /* evnt_multi */
    /*  720 */ int16 ev_mbclicks;                        /* evnt_multi default 2 */
    /*  722 */ void (*DEBUG_MEM)(void *defective);       /* Debuggable */
    /*  726 */ char cfg_path [__PS__];                   /* config path initially = apppath*/
    /*  854 */ char scrp_path [__PS__];                  /* initialised scrap-path */
    /*  982 */ void (*ACSerror)(int16 errmess, const void *para);    /* error-Routine */
    /*  986 */ int16 menu_id;                            /* ACC-Menu-ID or -1 */
    /*  988 */ char *dd_name;                            /* global available name for DD-Protos */
    /*  992 */ char *alert_name;                         /* own WinAlert-Name */
    /*  996 */ int16 mfsel_count;                        /* multi-Fsel-Counter */
    /*  998 */ char separator[256];                      /* Worttrenner */

    /* Langer Name der Applikation (u.a. fÅr GEMScript) */
    /* 1254 */ char *AppLongName;

    /* Die Config-Strings der Anwendung */
    /* 1258 */ UConfig *cfg;

    /* Allgemeine GEMScript-Funktion der Applikation */
    /* 1262 */ int16 (*GEMScript)( int16 anz, char **cmd, A_GSAntwort *antwort );

    /* new in 3.0.0: */
    /* Erlaubte, d.h. freigeschaltete Dead-Keys aus der Menge ^'`π\"¯,/~ */
    /* 1266 */ char ev_mkdead[10];

    /* Einstellung, ob eine nicht verarbeitete "normale" Taste zusammen mit */
    /* ALT oder CTRL als TastenkÅrzel fÅr Toolbar/Work-Objekt ausprobiert   */
    /* werden soll */
    /* 1276 */ int16 keyAltCtrlSwitch;

    /* Der MagiC-Cookie */
    /* 1278 */ MAGX_COOKIE *MagiCCookie;

    /* Der N.AES-Cookie */
    /* 1282 */ N_AESINFO *NAesCookie;
    /* 1286 */
} Ablk;

/******************************************************************************/

#define A_TOOLBAR    (0x1000)          /* Flag indicates Toolbar */
#define A_MASK       (0x0fff)          /* mask out pure index number */

/******************************************************************************/
/*                                                                            */
/* Definitionen der Nachrichten und Strukturen                                */
/* fÅr Fenster-/UserDef-Service-Funktionen                                    */
/*                                                                            */
/******************************************************************************/

/* Userdefined Objects Services */
#define AUO_CREATE         (1)               /* UObject can add or initialize data structs */
