
#define swd struct wd            /* local #undef */
swd;                             /* recursive use: Awindow */

/******************************************************************************/

typedef void (*Aaction)( void );

/******************************************************************************/

typedef swd* (*Acreate)( void *x );

/******************************************************************************/

/* Extended Object */
typedef struct
{
   /* Action-Routine fÅr Exit, TouchExit or Doppelklick */
   /*   0 */ Aaction click;
   
   /* Action-Routine fÅr Drag&Drop */
   /*   4 */ Aaction drag;
   
   /* ob_flags, muû an gleicher Stelle wie in OBJECT stehen, wird geprÅft! */
   /*   8 */ int16 ob_flags;
   
   /* Tastatur-Shortcut */
   /*  10 */ int16 key;
   
   /* User-Pointer */
   /*  12 */ void *userp1;
   /*  16 */ void *userp2;
   
   /* Maus-Index fÅr dieses Feld */
   /*  20 */ int16 mo_index;
   
   /* Objekt-Typ (nicht der AES Typ) */
   /*  22 */ int16 type;
   /*  24 */ 
} AOBJECT;

/******************************************************************************/

/* Extended USERBLK */
typedef struct
{
   /* Redraw-Routine, wie in USERBLK */
   /*  0 */ int16 CDECL (*ub_code)(PARMBLK *pb);
   
   /* Parameter wie in USERBLK */
   /*  4 */ long ub_parm;
   
   /* Service-Routne des Objektes */
   /*  8 */ int16 (*ub_serv)(OBJECT *entry, int16 task, void *in_out);
   
   /* Extra pointers (data) */
   /* 12 */ void *ub_ptr1;
   
   /* typically window */
   /* 16 */ void *ub_ptr2;
   
   /* typically obnr */
   /* 20 */ void *ub_ptr3;
   
   /* BubbleGEM-Hilfe-String */
   /* 24 */ char *bubble;
   
   /* Context-Popup-String fÅr Ame_strpopup */
   /* 28 */ char *context;
   /* 32 */ 
} AUSERBLK;

/******************************************************************************/

/* Maus-Parameter */
typedef struct
{
   /* Maus-Nummer, 255: durch form beschrieben */
   int16 number;
   
   /* Maus-Form oder NULL */
   MFORM *form;
} Amouse;

/******************************************************************************/

/* Struktur fÅr Antworten auf GEMScript-Kommandos */
typedef struct
{
   char **antwort;
   int16 anzahl;
   int16 ret_wert;
} A_GSAntwort;

/******************************************************************************/

/* Das (zentrale) Fenster-Objekt */
typedef struct wd
{
   /* Users object pointer */
   /*   0 */ void *user;
   
   /* Service-Routine */
   /*   4 */ int16 (*service)(swd *a, int16 task, void *in_out);
   
   /* Fenster erzeugen mit fenster abhÑngigem Parameter */
   /*   8 */ swd *(*create)(void *a);
   
   /* Fenster îffnen */
   /*  12 */ int16 (*open)(swd *a);
   
   /* Init-Routine des Fensters */
   /*  16 */ int16 (*init)(swd *a);
   
   /* Das sog. Work-Objekt im Fenster */
   /*  20 */ OBJECT *work;
   
   /* Die Toolbar des Fensters */
   /*  24 */ OBJECT *toolbar;
   
   /* Objektnr and aktuelle Position fÅr Edit-Felder im Fenster */
   /*  28 */ int16 ob_edit, ob_col;
   
   /* GEM-Fenster-Handle oder -1 */
   /*  32 */ int16 wi_id;
   
   /* Fenster-Attribute */
   /*  34 */ int16 wi_kind;
   
   /* Fenster-Koordinaten: akteulle (auûen), normale (auûen) und innere */
   /*  36 */ Axywh wi_act;
   /*  44 */ Axywh wi_normal;
   /*  52 */ Axywh wi_work;
   
   /* Letzte Slider-Position & ->Grîûe */
   /*  60 */ Axywh wi_slider;
   
   /* Offset des Work-Objektes */
   /*  68 */ int16 wi_nx, wi_ny;
   
   /* Raster des Fensters, Highbyte fÅr y, Lowbyte fÅr x */
   /*  72 */ int16 snap_mask;
   
   /* Name und Info-Zeile des Fensters */
   /*  74 */ char *name;
   /*  78 */ char *info;
   
   /* LÑnge des selektierten Edit-Textes, 0 fÅr keine Selektion */
   /*  82 */ int16 ob_len;
   
   /* ACS-Fenster-Attribute */
   /*  84 */ int16 kind;
   
   /* Status des Fensters */
   /*  86 */ int16 state;
   
   /* Objektnummer des Icons im verwaltenden Root-Fenster */
   /*  88 */ int16 icon;
   
   /* Das Icon-Image, NULL: Default-Icon */
   /*  90 */ CICONBLK *iconblk;
   
   /* Fenster-MenÅ */
   /*  94 */ OBJECT *menu;
   
   /* TastendrÅcke */
   /*  98 */ int16 (*keys)(swd *x, int16 kstate, int16 key);
   
   /* Status-énderungen von Objekten des Fensters */
   /* 102 */ void (*obchange)(swd *a, int16 obnr, int16 new_state);
   
   /* Reaktion auf Nachrichten des Screen-Managers */
   /* 106 */ void (*redraw)(swd *a, Axywh *b);     /* Redraw */
   /* 110 */ void (*topped)(swd *a);                  /* Topped */
   /* 114 */ void (*closed)(swd *a);                  /* Closed */
   /* 118 */ void (*fulled)(swd *a);                  /* Fulled */
   /* 122 */ void (*arrowed)(swd *a, int16 which); /* Arrowed */
   /* 126 */ void (*hslid)(swd *a, int16 pos);     /* HSlide */
   /* 130 */ void (*vslid)(swd *a, int16 pos);     /* VSlide */
   /* 134 */ void (*sized)(swd *a, Axywh *b);         /* Sized */
   /* 138 */ void (*moved)(swd *a, Axywh *b);         /* Moved */
   /* New in 3.0.0: */
   /* 142 */ int16 (*iconify)(swd *a, int16 all);  /* Iconify, Iconify All */
   /* 146 */ int16 (*uniconify)(swd *a);           /* Uniconify */
   
   /* Zeiger auf Funktion fÅr fensterspezifische GEMScript-Befehle */
   /* 150 */ int16 (*gemscript)(swd *a, int16 anz, char **cmds, A_GSAntwort *antwort );
   
   /* Titel der Hilfe-Seite */
   /* 154 */ char *help_title;
   
   /* Name der Hilfe-Datei */
   /* 158 */ char *help_file;
   /* 162 */ 
} Awindow;


/******************************************************************************/
/*                                                                            */
/* Die Konfigurations-String-UnterstÅtzung                                    */
/*                                                                            */
/******************************************************************************/

/* Maximale LÑnge eines Config-Strings insgesamt! */
#define MAX_CFGLEN 8192

/******************************************************************************/

typedef struct
{
   char *dateiname;
   char *comment;
   char *env_praefix;
   int16 casesensitiv;
   int16 file_sensitiv;
   int16 file_buffer;
} UCfgInfo;

/******************************************************************************/

/* Description start */
typedef struct
{
   /*   0 */ char     magic[8];            /* Magic "ACS 2.0" */
   /*   8 */ int16    version;             /* Version * 200 */
   /*  10 */ int16    dx,dy;               /* virtuell desktop increments */
   /*  14 */ uint16   flags;               /* commom flags */
   /*  16 */ char     acc_reg[32];         /* Accessory register message */
   /*  48 */ Awindow  *root;               /* Root window */
   /*  52 */ Awindow  *acc;                /* Accessory first window */
   /*  56 */ Amouse   mouse[32];           /* 32 Mouseforms */
   /* 248 */ char     *mess[];             /* multilinguale Strings */
} Adescr;

/* Initialisierungs-Infos fÅr den Anwendungsstart */
typedef struct
{
   /*   0 */ UCfgInfo CfgInfo;                                     /* Infos zum Laden der Cfg-Strings */
   /*  18 */ char *BaseName;                                       /* Zu verwendender Name fÅr basename */

   /* Initialisierungszeiger in ACSblk fÅr ACS-Interna */
   /*  22 */ void (*ACSterm)( void );                              /* Vor dem Terminieren von ACS */
   /*  26 */ void (*ACSaboutme)( void );                           /* Der Eintrag 'öber mich' */
   /*  30 */ void (*ACSclose)( void );                             /* ACS beenden (Eintrag 'Quit') */
   /*  34 */ void (*ACSmessage)( int16 *ev_mmgpbuf );              /* Unbekannte Messages bearbeiten */
   /*  38 */ void (*ACSmproto)( int16 *ev_mmgpbuf );               /* Message-Filter-Routine */
   /*  42 */ void (*ACStimer)( void );                             /* Timer am Ende der Event-Schleife */
   /*  46 */ void (*ACSkey)( int16 *kstate, int16 *key );          /* Tastendruck-Filter-Routine */
   /*  50 */ void (*ACSbutton)( int16 *button, int16 *breturn );   /* Maus-Button-Filter-Routine */
   /*  54 */ void (*ACSmouse)( void );                             /* Maus-Bewegungs-Filter-Routine */
   /*  58 */ void (*ACSwikey)( int16 *kstate, int16 *key );        /* Tastendruck-Filter-Routine vor wi->keys */

   /*  62 */ int16 init_prot;                                      /* Welche Protokolle sollen (komplett) initialisiert werden? */
   /*  64 */ int16 XAccType;                                       /* Maschinenlesbarer XAcc-Programmtyp */

   /* Initialisierungszeiger in ACSblk fÅr GEMScript */
   /*  66 */ int16 (*ACSGEMScript)( int16 anz, char **cmd, A_GSAntwort *antwort );   /* Allgemeine GEMScript-Funktion */

   /* Start-Funktionen fÅr ACS */
   /*  70 */ int16 (*ACSinit0)( void );                            /* Initialisierung nach GEM-Initialisierung */
   /*  74 */ int16 (*ACSinit)( void );                             /* Initialisierung nach der ACS-Initialisierung */

   /* Initialisierungszeiger in ACSblk fÅr AV-Protokoll */
   /* Noch nicht implementiert */
   /*  78 */ 
} Aconfig;

/* Flags fÅr die Initialisierung der Protokolle beim Systemstart */
/* Falls die Protokolle nicht initialisiert werden, wird dies    */
/* nachgeholt, sobald sie benîtigt werden!                       */
#define CFG_INIT_OLGA         0x0001      /* Starte ggf. OLGA-Manager nach, Anmeldung beim OLGA-Manager anstoûen */
#define CFG_INIT_OLGA_FULL    0x0002      /* ZusÑtzlich auf das Ende der OLGA-Initialisierung warten */
#define CFG_INIT_GEMSCRIPT    0x0004      /* Volle Initialisiere des GEMScript-Protokolles */
#define CFG_INIT_BUBBLEGEM    0x0008      /* Ggf. BubbleGEM nachstarten und intialisieren */

/* list of selected Objects */
typedef struct
{
   Awindow *window;                 /* the objects belong to this window */
   int16 maxlen;                    /* max entries in list */
   int16 actlen;                    /* actual count */
   int16 next;                      /* next entry return by Adr_next */
   int16 dragback;                  /* drag still selected object back to origin */
   int16 x, y;                      /* position during pick up */
   int16 rx, ry;                    /* relativ dragged distance */
   int16 *array;                    /* points to array of obnr's */
} Asel;

#define DD_PIPEDD (0x1)                   /* ATARI-Pipe-Drag&Drop */
#define DD_XACC   (0x2)                   /* XACC-D&D */
#define DD_VA     (0x4)                   /* VA-Server */

/* XACC-Messages */
#ifndef __xaccproto__
   #define __xaccproto__
   #define ACC_ID             0x400
   #define ACC_OPEN           0x401
   #define ACC_CLOSE          0x402
   #define ACC_ACC            0x403
   #define ACC_EXIT           0x404
   #define ACC_ACK            0x500
   #define ACC_TEXT           0x501
   #define ACC_KEY            0x502
   #define ACC_META           0x503
   #define ACC_IMG            0x504
#endif

/* AV-Messages */
#ifndef __vaproto__
   #define __vaproto__
   #define AV_PROTOKOLL       0x4700
   #define VA_PROTOSTATUS     0x4701
   #define AV_GETSTATUS       0x4703
   #define AV_STATUS          0x4704
   #define VA_SETSTATUS       0x4705
   #define AV_SENDCLICK       0x4709
   #define AV_SENDKEY         0x4710
   #define VA_START           0x4711
   #define AV_ASKFILEFONT     0x4712
   #define VA_FILEFONT        0x4713
   #define AV_ASKCONFONT      0x4714
   #define VA_CONFONT         0x4715
   #define AV_ASKOBJECT       0x4716
   #define VA_OBJECT          0x4717
   #define AV_OPENCONSOLE     0x4718
   #define VA_CONSOLEOPEN     0x4719
   #define AV_OPENWIND        0x4720
   #define VA_WINDOPEN        0x4721
   #define AV_STARTPROG       0x4722
   #define VA_PROGSTART       0x4723
   #define AV_ACCWINDOPEN     0x4724
   #define VA_DRAGACCWIND     0x4725
   #define AV_ACCWINDCLOSED   0x4726
   #define AV_COPY_DRAGGED    0x4728
   #define VA_COPY_COMPLETE   0x4729
   #define AV_PATH_UPDATE     0x4730
   #define AV_WHAT_IZIT       0x4732
   #define VA_THAT_IZIT       0x4733
   #define AV_DRAG_ON_WINDOW  0x4734
   #define VA_DRAG_COMPLETE   0x4735
   #define AV_EXIT            0x4736
   #define AV_STARTED         0x4738
   #define VA_OB_UNKNOWN      0     
   #define VA_OB_TRASHCAN     1
   #define VA_OB_SHREDDER     2
   #define VA_OB_CLIPBOARD    3
   #define VA_OB_FILE         4
   #define VA_OB_FOLDER       5
   #define VA_OB_DRIVE        6
   #define VA_OB_WINDOW       7
#endif

#ifndef __gemscript__
   #define __gemscript__
   typedef struct
   {
      long len;      /* LÑnge der Struktur in Bytes */
      int16 version; /* Versionsnummer des Protokolles beim Sender (z.Z. 0x0120 = 1.2) */
      int16 msgs;    /* Bitmap der unterstÅtzten Nachrichten und FÑhigkeiten (GSM_xxx) */
      long ext;      /* benutzte Endung, etwa '.SIC'                     */
   } GS_INFO;
   
   /* Kennung fÅr den Empfang von GS_COMMAND */
   #define GSM_COMMAND     0x0001
   
   /* Kennung fÅr Empfang von GS_OPENMACRO, GS_WRITE */
   /* und GS_CLOSEMACRO und Senden von GS_MACRO      */
   #define GSM_MACRO       0x0002
   
   /* Kennung fÅr Versand von GS_OPENMACRO, GS_WRITE */
   /* und GS_CLOSEMACRO und Empfang von GS_MACRO     */
   #define GSM_WRITE       0x0004
   
   /* Hex-Codierung wird verstanden */
   #define GSM_HEXCODING   0x0008
   
   /* RÅckgabewerte der GEMScript-Funktionen (Anwendung & Fenster) */
   #define GSACK_OK        0
   #define GSACK_UNKNOWN   1
   #define GSACK_ERROR     2
   
#endif

typedef struct
{
   int16 id;                     /* the AES-ID of another PRG */
   long  type;                   /* same bitvec as dd_active   */
   unsigned int16 xacc_val;      /* DD-dependant-value: XACC->groups */
   const char  *xacc_name;       /* name of partner, or NULL */
   unsigned int16 va_val[3];
   const char  *va_name;
} A_dd;

typedef struct
{
   Awindow *window;
   OBJECT *entry;
   int16 obnr;
} Awiob;

/******************************************************************************/
/*                                                                            */
/* Die lineare unsortierte Liste                                              */
/*                                                                            */
/******************************************************************************/

/* Keine FOR-Funktion, alle sollen bearbeitet/gesucht werden */
#define NO_FOR (int16 (*)(void *,void *)) NULL

typedef int16 (*A_ListFor)(void *para, void *elem);
typedef void (*A_ListWork)(void *para, void *elem);

typedef struct _ULinList
{
   /* Der Zeiger auf die lineare Liste (soll nur ACS-intern verwendet werden!) */
   /*   0 */ void *ListData;

   /* Zeiger auf Funktion, die die Elemente der Liste freigeben kann */
   /*   4 */ void (*freeElem)( void *elem );

   /* Die lineare Liste leeren, alle Daten freigeben */
   /*   8 */ void (*clear)( struct _ULinList *liste );

   /* AnhÑngen neuer Daten an die Liste */
   /*  12 */ int16 (*append)( struct _ULinList *liste, void *new_data );

   /* EinfÅgen neuer Daten in die Liste */
   /*  16 */ int16 (*insert)( struct _ULinList *liste, void *new_data, int16 before_obj );

   /* Daten aus der Liste lîschen und zurÅckgeben */
   /*  20 */ void *(*delete)( struct _ULinList *liste, int16 data_nr );

   /* Alle Daten aus der Liste lîschen, die eine bestimmte Bedingung erfÅllen     */
   /* Der Parameter para wird an den gleichnamigen Parameter der in to_delete     */
   /* Åbergebenen Funktion weitergereicht (z.B. öbergabe der Vergleichskriterien) */
   /*  24 */ int32 (*deleteFor)( struct _ULinList *liste, void *para,
