#include <stdio.h>
#include <acs.h>
#include <acsaes.h>
#include <string.h>

#ifdef __GNUC__
/* no need to attempt to generate identical image */
#undef WITH_FIXES
#define WITH_FIXES 1
#endif

#define __PS__   128

#define MAX_ACS   16
#define MAX_WINDS 256
#define PATH_SEP  '\\'
#define MAX_LANGS 3
#define LABEL_MAX 32
#define STRING_MAX 256

/*
 * sometimes we have to cast away constness
 */
#ifndef NO_CONST
#  ifdef __GNUC__
#	 define NO_CONST(p) __extension__({ union { const void *cs; void *s; } x; x.cs = p; x.s; })
#  else
#	 define NO_CONST(p) ((void *)(p))
#  endif
#endif

#undef UNUSED
#define UNUSED(x) (void)(x)


struct UConfig {
    /*   0 */ char id;
    /*   1 */ char username[128];
    /* 129 */ char userserial[11];
    /* 140 */ char userkey[11];
    /* 151 */ char helpname[9];
    /* 160 */ boolean gluepart;
    /* 162 */ int16 save;
    /* 164 */ boolean dirty;
    /* 166 */ boolean snapping;
    /* 168 */ boolean copyindex;
    /* 170 */ int16 imagesnap;
    /* 172 */ boolean refimages;
    /* 174 */ int16 flags;
    /* 176 */ Axywh pxywh;
    /* 184 */ Axywh bxywh;
    /* 192 */ char last_path[__PS__];
    /* 320 */ int16 used;
    /* 322 */ char acs[MAX_ACS][__PS__];
    /*2370 */ 
};

typedef struct _Obj_Head Obj_Head;
typedef struct _ACS_HEAD ACS_HEAD;

typedef struct {
	Awindow *w_cews;
	Awindow *w_edit[MAX_ACS];
	char p_edit[MAX_ACS][__PS__];
} CEWSDATA;

struct _Obj_Head {
	/*   0 */ Obj_Head *next;
	/*   4 */ void *object;
	/*   8 */ uint16 oh_id;
	/*  10 */ ssize_t size;
	/*  14 */ ssize_t used;
	/*  18 */ Awindow *window;
	/*  22 */ char label[LABEL_MAX];
	/*  54 */ int16 usage;
	/*  56 */ int16 flags;
	/*  58 */ Axywh pos;
	/*  66 */
};
/* OBJ_HEAD.flags */
#define OBJ_GLOBAL           0x0100
#define OBJ_USERDEFINED      0x0200
#define OBJ_LOCAL            0x0400


typedef struct {
	/*   0 */ ACS_HEAD *acs;
	/*   4 */ Obj_Head *objlist;
	/*   8 */ Awindow *window;
	/*  12 */ char *name;
	/*  16 */ const char *asktitle;
	/*  20 */ int16 type;
	/*  22 */ Obj_Head *prototyp;
	/*  26 */ Obj_Head *(*copy_ob)(ACS_HEAD *acs, const Obj_Head *obj);
	/*  30 */ void (*del_ob)(ACS_HEAD *acs, Obj_Head *obj);
	/*  34 */ OBJECT *(*new_work)(Obj_Head *objlist);
	/*  38 */ boolean (*service)(ACS_HEAD *acs, int16 task, Obj_Head *obj);
	/*  42 */ 
} LISTPARM;
/*
 * LISTPARM.type
 */
#define LIST_OBJECT      10000
#define LIST_MENU        10001
#define LIST_POPUP       10002
#define LIST_WINDOWS     10007
#define LIST_STRING      10010
#define LIST_TEDINFO     10011
#define LIST_REFS        10012
#define LIST_ALERT       10014
#define LIST_USERBLK     10015
#define LIST_ICON        10016
#define LIST_IMAGE       10017
#define LIST_MOUSE       10018
#define LIST_AMOUSE      10019
#define LIST_DATA        10020

/*
 * LIST services
 */
#define LS_CREATEOBJ   1
#define LS_CHANGEOBJ   2
#define LS_DELETEOBJ   3


typedef struct {
	/*   0 */ char magic[8];
	/*   8 */ int16 version;
	/*  10 */ int16 dx;
	/*  12 */ int16 dy;
	/*  14 */ int16 flags;
	/*  16 */ char acc_reg[32];
	/*  48 */ Obj_Head *root;
	/*  52 */ Obj_Head *acc;
	/*  56 */ Amouse mouse[32];
	/* 248 */
} Aolddescr;

struct _ACS_HEAD {
	/*   0 */ int32 magic;
	/*   4 */ int16 version;
	/*   6 */ int16 flags;
	/*   8 */ char *filename;
	/*  12 */ Awindow *window;
	/*  16 */ Obj_Head *labels;
	/*  20 */ Obj_Head *wi_list;  /* windows */
	/*  24 */ Obj_Head *ob_list;  /* objects */
	/*  28 */ Obj_Head *me_list;  /* menus */
	/*  32 */ Obj_Head *pu_list;  /* popups */
	/*  36 */ Obj_Head *al_list;  /* alerts */
	/*  40 */ Obj_Head *te_list;  /* tedinfos */
	/*  44 */ Obj_Head *ic_list;  /* icons */
	/*  48 */ Obj_Head *im_list;  /* images */
	/*  52 */ Obj_Head *st_list;  /* strings */
	/*  56 */ Obj_Head *us_list;  /* userdefs */
	/*  60 */ Obj_Head *rf_list;  /* references */
	/*  64 */ Obj_Head *mo_list;  /* mouses */
	/*  68 */ Obj_Head *if_list;  /* data */
	/*  72 */ Obj_Head *list_3;
	/*  76 */ Aolddescr descr; /* does not include mess[AD_COUNT] */
	/* 324 */ Awindow *wi_palette;
	/* 328 */ Awindow *wi_descr;
	/* 332 */ Axywh pos_ge;       /* position of general window */
	/* 340 */ Axywh pos_pa;       /* position of palette window */
	/* 348 */ Axywh pos_ds;       /* position of description window */
	/* 356 */ long obj_count;
	/* 360 */ Axywh last_rez;
	/* 368 */ int32 extflags;
	/* 372 */ char backup[__PS__]; /* path for backups */
	/* 500 */ int16 language;     /* current language being edited */
	/* 502 */ Obj_Head *mlst_list[MAX_LANGS]; /* strings of other languages */
	/* 514 */ Obj_Head *mlal_list[MAX_LANGS]; /* alert strings of other languages */
	/* 526 */ int16 src_lang;     /* compiler output language */
	/* 528 */ Awindow *wi_config;
	/* 532 */ Aconfig config;
	/* 610 */
};
#define ACS_MAGIC 0x2e414353L /* ".ACS" */

/*
 * ACS_HEAD.src_lang
 */
#define ACS_LANG_C      0
#define ACS_LANG_PASCAL 1


/*
 * ACS_HEAD.flags
 */
#define ACS_CHANGED     0x0001
#define ACS_0002        0x0002
#define ACS_0004        0x0004
#define ACS_0008        0x0008
#define ACS_0010        0x0010
#define ACS_0020        0x0020
#define ACS_0040        0x0040
#define ACS_0080        0x0080
#define ACS_0100        0x0100
#define ACS_0200        0x0200
#define ACS_0400        0x0400
#define ACS_SRCOUTPUT   0x0800
#define ACS_LOCAL       0x1000
#define ACS_PROTOTYPES  0x2000
#define ACS_IGNORECASE  0x4000
#define ACS_SUBMODUL    0x8000

/*
 * ACS_HEAD.extflags
 */
#define ACS_EXT_PROTOCOL  0x0001
#define ACS_EXT_BACKUP    0x0002


/*
 * extra mouse forms
 */
#define MOUSE_BRUSH_BLACK  8
#define MOUSE_BRUSH_WHITE  9
#define MOUSE_BRUSH_TRANS 10
#define MOUSE_OBJ_DRAG    11
#define MOUSE_OBJ_ADD     12


typedef struct {
	/*   0 */ Obj_Head *label;
	/*   4 */ Obj_Head *type;
	/*   8 */ OBJECT obj;
	/*  32 */ AOBJECT aobj;
	/*  56 */
} OBJ_ENTRY;

typedef struct {
	/*   0 */ CICONBLK cicon;
	/*  38 */ CICON c16;
	/*  60 */ CICON c256;
	/*  82 */
} ACSCICONBLK;

#define DATA_OFFSET 3

typedef struct {
	ACS_HEAD *acs;
	Obj_Head *obj;
	/* ^^^ must match first entries of LISTPARM */
} EDPARM;

typedef struct {
	ACS_HEAD *acs;
	Obj_Head *obj;
	Awindow *editor;
	/* ^^^ must match first entries of LISTPARM */
} REFPARM;

typedef struct {
	ACS_HEAD *acs;
	Obj_Head *obj;
	OBJECT *work;
	OBJECT *edit;
	int16 *data;
	int16 *mask;
	CICON c16;
	CICON c256;
	int16 color;
	int16 brush;
} ICONPARM;

typedef struct {
	ACS_HEAD *acs;
	Obj_Head *obj;
	OBJECT *work;
	OBJECT *edit;
	int16 *data;
} IMAGEPARM;

typedef struct {
	ACS_HEAD *acs;
	Obj_Head *obj;
	int16 flags;
	int16 act_obnr;
	int16 px;
	int16 py;
	int16 x;
	int16 y;
	int16 w;
	int16 h;
	int16 active;
	void (*ok)(void);
	int16 *select;
	void (*cleanup)(OBJECT *tree);
	char *oldtitle;
	char *oldhlptitle;
	char *oldhlpfile;
} OBJEDPARM;

typedef struct {
	MFDB org;
	MFDB *trans;
	long count;
} AMFDB;

typedef struct {
	OBJECT *tree;
	void (*ok)(void);
	void (*cleanup)(OBJECT *tree);
	char *title;
	char *help_title;
	char *help_file;
} SUBMODE;

typedef struct {
	unsigned long xfsl;
	uint16 revision;
	unsigned long product;
	uint16 version;
	int16 CDECL (*xfsl_input)(int16 vdihandle, uint16 fontflags, const char *headline, int16 *id, int16 *size);
	int16 CDECL (*xfsl_init)(int16 vdihandle, void *xpar);
	int16 CDECL (*xfsl_event)(int16 xfsl_handle, void *event);
	int16 CDECL (*xfsl_exit)(int16 xfsl_handle);
	long CDECL (*xfsl_info)(void);
} xFSL;

typedef struct {
	char *grp_name;
	int16 anzahl;
	char **cfg_strings;
} ACSCfgGruppe;

typedef struct {
	UCfgInfo info;
	int16 changed;
	int16 grp_anzahl;
	ACSCfgGruppe **cfg_grp;
	int16 flags;
	int16 head_anz;
	char **header;
} ACSConfig;

typedef struct {
	char *grp_name;
	ACSCfgGruppe *gruppe;
	char *name;
	char *value;
	int16 index;
} ACSCfgSearchStruct;

typedef struct {
	int16 v[8];
} outline;

typedef struct {
	char *popup;
	long len;
} ddPopStruc;

#if 0
/* local to editwi */
typedef struct {
	int16 xr;
	int16 yr;
	int16 x1;
	int16 x2;
	int16 y1;
	int16 y2;
	int16 m[8];
} t;
#endif

typedef struct {
	Awindow *window;
	OBJECT *object;
	int16 obnr;
	int16 mmox;
	int16 mmoy;
	int16 mmokstate;
	int16 busy;
	Amouse mouse;
} CONTEXT;

typedef struct _ACSLinListElemStruct ACSLinListElemStruct;
struct _ACSLinListElemStruct
{
	ACSLinListElemStruct *next;
	ACSLinListElemStruct *last;
	void *data;
};

typedef struct
{
	int32 block_size;
	char *descr_text;
	int16 max_liste;
	int16 aktuell_liste;
	int16 max_used;
	int16 opt_anzahl;
	/* ^^^ same as MemFreeBlockStat */
	ACSLinListElemStruct *liste;
} MemFreeBlockList;

typedef struct memx {
	struct memx *prev;
	long used;
	void *entry[32];
} MEMX;

typedef struct {
	int16 count;
	int16 *planes;
} a_hcicon;

typedef struct {
	const char *cmd;
	void (*gs_fkt)(void);
} gs_cmd;

typedef struct {
	ThermoData aktData;
	const char *title;
	int16 prozent;
	int16 thermArt;
	int16 thermComp;
	int16 color;
	int16 running;
	long timer;
	Awindow *thermo;
} ThermoStruct;

typedef struct {
	int16 *message;
	Axywh area;
	Awindow *window;
	AOBJECT *drag_aob;
	OBJECT *drag_obj;
	int16 drag_obnr;
	int16 drag_obednr;
	int16 scroll;
} MsgFktParams;

typedef struct {
	int16 MsgNr;
	void (*MsgFunktion)(void);
	char WindOffset;
	char XOffset;
	char YOffset;
	char WOffset;
	char HOffset;
	char draginfos;
	int16 scrolloffset;
} MsgService;

typedef struct {
	int16 dest_id;
	Awindow *window;
	int16 timeout;
	int16 type;
	int16 message[8];
} MsgWaitForAnswer;

typedef struct {
	int16 dest_id;
	int16 type;
	int16 *ref_msg[8];
} MsgSearchForOriginal;

typedef struct {
	int16 msg_id;
	long timestamp;
	void *globData;
} XAccData;

typedef struct {
	int16 msg_id;
	long timestamp;
	void *globData;
} AVData;

typedef struct {
   int16       id;            /* The AES-ID of another PRG        */
   int32       type;          /* Same bitvec as dd_active         */
   uint16      xacc_val;      /* DD-dependant-value: XACC->groups */
   const char  *xacc_name;    /* Name of Partner, or NULL         */
   uint16      va_val[3];     /* Status-Bits of VA_PROTOSTATUS    */
   const char  *va_name;      /* The VA-Name                      */
   /* ^^^ same as A_dd */
   XAccData xacc_data;
   AVData *va_data;
} A_dd_int;

typedef struct {
	int16 *message;
	Awindow *wd;
	int16 timeout;
	int16 type;
} MsgAllStruct;

typedef struct {
	int16 ap_id;
	GS_INFO info;
	int16 gs_id;
	int16 status;
} gs_con;

typedef struct {
	int16 ap_id;
	int16 gs_id;
	int16 status;
	int16 set_flag;
} gs_search;

typedef struct {
	int16 message[8];
	A_GSAntwort antwort;
} gs_answer;

typedef struct {
	OLGA_Infos info;
	int16 olga_flags;
	int16 grp_id;
	int16 server_id;
	int16 info_index;
	int16 aktiv;
	int16 aktiv_anz;
	int16 delete;
} OLGA_Data;

typedef struct {
	int16 col;
	char *text;
	Awiob self;
} FTEXTDATA;

typedef struct {
	char *act;
	char *pos;
	char *popup;
	Awiob self;
} CYCDATA;

typedef struct {
	char act[256];
	char text[256];
	char *mask;
	Awiob wiob;
	int16 len;
	int16 *pos;
	int16 *blklen;
	int16 prevpos;
	int16 prevblklen;
	int16 offset;
	int16 cw;
	int16 ch;
	int16 flag;
} EDT_DATA;

typedef struct {
	/*  0 */ const char *title;
	/*  4 */ int16 x;
	/*  6 */ int16 y;
	/*  8 */ int16 *handle;
	/* 12 */ char *path;
	/* 16 */ int16 pathlen;
	/* 18 */ char *fname;
	/* 22 */ int16 fnamelen;
	/* 24 */ char *patterns;
	/* 28 */ XFSL_FILTER *filter;
	/* 32 */ char *paths;
	/* 36 */ int16 sort_mode;
	/* 38 */ int16 flags;
	/* 40 */ void *dialog;
	/* 44 */ boolean modal;
	/* 46 */ int16 button;
	/* 48 */ int16 nfiles;
	/* 50 */ Awindow *meldung;
	/* 54 */ Awindow *window;
	/* 58 */ ULinListe *liste;
	/* 62 */ 
} A_FileSelData;

typedef struct {
	char *title;
	int16 x;
	int16 y;
	PRN_SETTINGS *printData;
	void **dialog;
	int16 option;
	boolean is_my_setting;
	boolean is_print_dialog;
	int16 flags;
	boolean modal;
	int16 button;
	int16 choosed;
	Awindow *meldung;
	Awindow *window;
} A_PrintSelData;

typedef struct {
	int16 x;
	int16 y;
	int16 button_flag;
	void **dialog;
	const char *sample;
	const char *opt_button;
	int16 font_flag;
	A_FontSel fontData;
	int16 flags;
	boolean modal;
	int16 choosed;
	int16 toClose;
	void *para;
	void (*set)(void);
	void (*mark)(void);
	void (*opt)(void);
	Awindow *meldung;
	Awindow *window;
} A_FontSelData;

typedef struct _ACSLinListStruct {
	ACSLinListElemStruct *Beginn;
	ACSLinListElemStruct *Ende;
	long Anzahl;
	ACSLinListElemStruct *LaufVar;
	long LaufVarNr;
} ACSLinListStruct;

typedef struct {
	void **funcs;
	int16 version;
} funcVersion;

typedef struct {
