/******************************************************************************/
/*                                                                            */
/*    ACS               Application Construction System                       */
/*    DESCRIPTION:      Text editor userdef object                            */
/*                                                                            */
/* (c) 1991-2004 Stefan Bachert, Oliver Michalak, Martin Elsaesser            */
/* (c) 2022 Thorsten Otto                                                     */
/******************************************************************************/

#include "acs_i.h"
#include "acsplus.h"
#include "country.h"

#if WITH_FIXES && COUNTRY != COUNTRY_DE
#  define NOTHING_FOUND "Nothing found."
#  define NO_PAREN "No parenthesis."
#else 
#  define NOTHING_FOUND "Nichts gefunden."
#  define NO_PAREN "Keine Klammer."
#endif


#define MAX_COLS     512

typedef struct {
	char *text;
	int16 size;
	int16 flags;
} EDITLINE;

/* EDITLINE.flags */
#define EDITLINE_SELECTED     0x0001
#define EDITLINE_INVERSE  0x0002

typedef struct {
	/*   0 */ int16 color;
	/*   2 */ int16 face;     /* font ID */
	/*   4 */ int16 cheight;  /* font size */
	/*   6 */ int16 height;
	/*   8 */ int16 width;
	/*  10 */ long row;       /* number of rows in window */
	/*  14 */ long col;
	/*  18 */ int16 flags;
	/*  20 */ long wrap;
	/*  24 */ long start_row;
	/*  28 */ long start_col;
	/*  32 */ long max_col;
	/*  36 */ long t_size;
	/*  40 */ long t_act;
	/*  44 */ EDITLINE *table;
	/*  48 */ long sel1row;
	/*  52 */ long sel1col;
	/*  56 */ long sel2row;
	/*  60 */ long sel2col;
	/*  64 */ long curv1;
	/*  68 */ long curv2;
	/*  72 */ int16 pheight;
	/*  74 */ int16 pwidth;
	/*  76 */ long orow;
	/*  80 */ long ocol;
	/*  84 */ Awiob self;
	/*  94 */ OBJECT *hor;
	/*  98 */ OBJECT *ver;
	/* 102 */ long single;
	/* 106 */ long till;
	/* 110 */ int16 wraps;
	/* 112 */ int16 select;
	/* 114 */ EDITLIVE live;
	/* 122 */ long cut1row;
	/* 126 */ long cut1col;
	/* 130 */ long cut2row;
	/* 134 */ long cut2col;
	/* 138 */ long ins2row;
	/* 142 */ long ins2col;
	/* 146 */ long nrow;
	/* 150 */ char **text;
	/* 154 */ int16 tabsize;
	/* 156 */ int16 cursor;
	/* 158 */ int16 err;
	/* 160 */ char separator[257];
	/* 418 */
} EDITTEXT;

/* EDITTEXT.flags */
#define EDITTEXT_NEEDS_RESIZE      0x0001
#define EDITTEXT_TILL              0x0002
#define EDITTEXT_SINGLE            0x0004
#define EDITTEXT_FULLUPDATE        0x0008
#define EDITTEXT_WRAP              0x0010
#define EDITTEXT_CURON             0x0020
#define EDITTEXT_CHANGECUR         0x0040
#define EDITTEXT_CURVIS            0x0080
#define EDITTEXT_INVERS            0x0100
#define EDITTEXT_HAS_SELECTION     0x0200
#define EDITTEXT_WORD              0x0400
#define EDITTEXT_NOCASE            0x0800
#define EDITTEXT_BACKWARD          0x1000
#define EDITTEXT_CHANGED           0x2000

/* EDITTEXT.select */
#define EDIT_SELECT_CHAR         0 /* select charmode */
#define EDIT_SELECT_01           1 /* select one or nothing */
#define EDIT_SELECT_1            2 /* select exactly one */
#define EDIT_SELECT_CONTINUES    3 /* select continous */
